Repo/ph_mediated_sample_stacking/phMSS/constant/ampholyteProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1.7.1                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 ampholytes
 ( 
FORMIC_ACID 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.463146810385034e-09; 
 mobility 6(0.0 0.0 0.0 5.6600000000000004e-08 0.0 0.0); 
 pk 6(1000000.0 100000.0 10000.0 0.1770108958317422 1e-13 1e-14);
 K1 5(0.0 0.0 0.0 0.0 0.0);
 K2 25(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
LYSINE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.4243708348447947e-09; 
 mobility 6(0.0 5.5100000000000004e-08 2.8600000000000005e-08 2.64e-08 0.0 0.0); 
 pk 6(1000000.0 16.218100973589298 7.464487584100654e-07 1.6218100973589333e-08 1e-13 1e-14);
 K1 5(0.0 0.0 0.0 0.0 0.0);
 K2 25(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
ALANINE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 9.280383479297302e-10; 
 mobility 6(0.0 0.0 3.5900000000000004e-08 3.2200000000000004e-08 0.0 0.0); 
 pk 6(1000000.0 100000.0 5.623413251903491 1.3899526312133555e-07 1e-13 1e-14);
 K1 5(0.0 0.0 0.0 0.0 0.0);
 K2 25(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
GLUTAMIC_ACID 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 1.4036903145566668e-09; 
 mobility 6(0.0 0.0 2.8700000000000002e-08 2.7e-08 5.43e-08 0.0); 
 pk 6(1000000.0 100000.0 7.244359600749899 0.04742419852602448 1.0964781961431829e-07 1e-14);
 K1 5(0.0 0.0 0.0 0.0 0.0);
 K2 25(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
TRYPTOPHANE 
 {
 diffusivity diffusivity [0 2 -1 0 0 0 0 ] 6.617766492200861e-10; 
 mobility 6(0.0 0.0 2.5600000000000004e-08 2.54e-08 0.0 0.0); 
 pk 6(1000000.0 100000.0 4.897788193684462 2.5468302525850447e-07 1e-13 1e-14);
 K1 5(0.0 0.0 0.0 0.0 0.0);
 K2 25(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0);
}
    );
/***************paper parameters*******************/
 sigma_0 sigma_0 [-1 -3 2 0 1 1 0] 0;
 phip            phip [ 0 0 0 0 0 0 0 ] 1;
 taup            taup [ 0 0 0 0 0 0 0 ] 1;
 sc             sc [ 0 1 0 0 0 0 0 ] 0;
 se             se [ 0 1 0 0 0 0 0 ] 0;
 Kperm          Kperm   [ 0 2 0 0 0 0 0 ] 1;
 zeta           zeta [1 2 -3 0 0 -1 0] -0.0;
 rho_fluid rho_fluid  [1 -3 0 0 0 0 0] 1000.0;
/**************************************************************************/ 
