Repo/ph_mediated_sample_stacking/phMSS/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
4000
(
(3.33013333e-05 -1.13645479e-22 1.57618428e-05)
(3.33013333e-05 0 4.7309167e-05)
(3.33013333e-05 0 7.8903804e-05)
(3.33013333e-05 0 0.000110545825)
(3.33013333e-05 1.53399524e-22 0.0001422353)
(3.33013333e-05 0 0.000173972301)
(3.33013333e-05 0 0.0002057569)
(3.33013333e-05 0 0.000237589167)
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
4000
(
(4.9952e-05 0 1.57618428e-05)
(4.9952e-05 0 4.7309167e-05)
(4.9952e-05 0 7.8903804e-05)
(4.9952e-05 0 0.000110545825)
(4.9952e-05 0 0.0001422353)
(4.9952e-05 0 0.000173972302)
(4.9952e-05 0 0.0002057569)
(4.9952e-05 0 0.000237589167)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (3.33013333e-05 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (3.33013333e-05 0 0.8);
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
